// KINGDOM OF KROZ II, Level 10 by Scott Miller 11/12/89
// Original Source: 1987-1990 Scott Miller

const map = `
!+-----+----+------+##%VVOOOOO44U44OOOOVV%##3333333333333333333K
-----+--+-----+-----##VVVOOOOO44444OOOOVVV##66666666666666666663
+--+------+--------+##OOOOOOOO##5##OOOOOOO##                  63
-----+-------+----+-##OOOOOOOO##?##OOOOOOO##                  63
---+-----+------+---##VVVOOOOOO###OOOOOVVV##XXXXX             63
-+----+-------+-----##CVVOOOOOOO#OOOOOOVVC##XXXXX             63
+-------+--------+-U##CVVOOOOOOOOOOOOOOVVC##UXXXX             63
###############################OOO##############################
MMMMMMMMMMMMMMMMMMMM##S                  S##11111111111111111111
MMMMMMMMMMMMMMMMMMMM##                    ##11111111111111111111
@@@@@@@@@@@@@@@@@@@@##         000        ##11111111111111111111
K@@@@@@@@@@@@W                 0P0        HB11111111111B1111111ñ
@@@@@@@@@@@@@@@@@@@@##         000        ##11111111111111111111
MMMMMMMMMMMMMMMMMMMM##                    ##11111111111111111111
MMMMMMMMMMMMMMMMMMMM##S                  S##11111111111111111111
###############################~~~##############################
111111111111111111-U##C00000000---0-000---##U-))I)))))))333))))-
1(((((((((((((((((--##-0000H---0000---0-0-##--)I)))))))333))))-*
1(((((((TTT((((((((1##00000000 00000000000##))I)))))))333))))-*I
1(((((((TTT((((((((1##-0-00000000000000-00##)I)))))))333))))-*I*
1(((((((TTT((((((((1##00-0-----0000000<[|"##I)))))))333))))-*I*I
1((((((((((((((((((1##-#####################)))))))333))))-*I*I*
ó1111111111111111111##C-------D-D-D]]Eò&LL##K)))))333))))-*I*I*C`;

export default {
  id: 'Kingdom10',
  map,
  tabletMessage: 'Sometimes, Adventurer, Gems can be crystal clear.',
};

// HideGems:=true;
// Moving walls
// Needs boulders to break EWalls
